# Read and write CSV and XLS files

In [3]:
import pandas as pd
df_c = pd.read_csv('https://raw.githubusercontent.com/NeilPandey/Test_Dataset/master/Wholesale%20customers%20data.csv')
df_c.head()

   Channel  Region  Fresh  Milk  Grocery  Frozen  Detergents_Paper  Delicassen
0        2       3  12669  9656     7561     214              2674        1338
1        2       3   7057  9810     9568    1762              3293        1776
2        2       3   6353  8808     7684    2405              3516        7844
3        1       3  13265  1196     4221    6404               507        1788
4        2       3  22615  5410     7198    3915              1777        5185

In [3]:
diabetes = pd.read_csv("https://raw.githubusercontent.com/NeilPandey/Test_Dataset/master/diabetes.csv")
diabetes.head()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1

In [2]:
df_j = pd.read_json("/Users/neil/Downloads/student.json")
df_j.head()

   id first_name  last_name                   email  gender      ip_address
0   1   Jeanette  Penddreth  jpenddreth0@census.gov  Female     26.58.193.2
1   2    Giavani   Frediani   gfrediani1@senate.gov    Male   229.179.4.212
2   3      Noell        Bea     nbea2@imageshack.us  Female  180.66.162.255
3   4    Willard      Valek          wvalek3@vk.com    Male    67.76.188.26

In [3]:
#INSTALL: pip3 install xlrd

#read excel file 
df_e = pd.read_excel('/Users/neil/Downloads/Sample_Superstore.xls')
df_e.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2016-138688,2016-06-12,2016-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164

In [12]:
df_e.City.describe()

count              9994
unique              531
top       New York City
freq                915
Name: City, dtype: object

In [21]:
df_LA = df_e[['Order ID', 'Ship Date', 'Customer ID', 'Customer Name', 'Country','City','Sales', 'Profit']][df_e['City']=='Los Angeles']
#df_LA.shape

In [22]:
#write DF to csv
df_LA.to_csv('/Users/neil/Desktop/OnlyLA.csv', index=False)

In [7]:
# INSTALL: pip3 install openpyxl

#write DF to Excel
df_e.to_excel('/Users/nilesh/Desktop/new1.xlsx', sheet_name='weather_data')
df_e

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

# GROUP-BY

In [4]:
import pandas as pd
df = pd.read_csv('/Users/neil/Downloads/weather_new_cities.csv')
df.head() #weather by cities

        Day    city  temp  wspeed  event
0  1/1/2017      NY    32       6   Rain
1  1/2/2017      NY    36       7  Sunny
2  1/3/2017      NY    28      12   Snow
3  1/4/2017      NY    33       7  Sunny
4  1/1/2017  Mumbai    32       5  Sunny

In [25]:
df.shape

(5, 5)

In [33]:
df.dtypes

day            object
city           object
temperature     int64
windspeed       int64
event          object
dtype: object

In [26]:
df.city.unique()

array(['NY', 'Mumbai'], dtype=object)

In [5]:
g = df.groupby('city')
for day,city_n in g:
    print(city_n)

        Day    city  temp  wspeed  event
4  1/1/2017  Mumbai    32       5  Sunny
        Day city  temp  wspeed  event
0  1/1/2017   NY    32       6   Rain
1  1/2/2017   NY    36       7  Sunny
2  1/3/2017   NY    28      12   Snow
3  1/4/2017   NY    33       7  Sunny

In [30]:
#or to get specific group
g.get_group('NY')

        Day city  temp  wspeed  event
0  1/1/2017   NY    32       6   Rain
1  1/2/2017   NY    36       7  Sunny
2  1/3/2017   NY    28      12   Snow
3  1/4/2017   NY    33       7  Sunny

In [18]:
df[['Day','city','temp','wspeed','event']][df['city'] == 'NY']

        Day city  temp  wspeed  event
0  1/1/2017   NY    32       6   Rain
1  1/2/2017   NY    36       7  Sunny
2  1/3/2017   NY    28      12   Snow
3  1/4/2017   NY    33       7  Sunny

In [22]:
g.get_group('Mumbai')

        Day  temp  wspeed  event
4  1/1/2017    90       5  Sunny

In [6]:
#Find maximum temperature in each of the cities
print(g.min())

             Day  temp  wspeed  event
city
Mumbai  1/1/2017    32       5  Sunny
NY      1/1/2017    28       6   Rain

In [24]:
print(g.mean())

         temp  wspeed
city
Mumbai  90.00     5.0
NY      32.25     8.0

In [56]:
print(g.describe())

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

# concatenate Data Frames

In [1]:
import pandas as pd
india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})

india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [2]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [5]:
#concate two dataframes
df = pd.concat([india_weather, us_weather])
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [6]:
#if you want continuous index
df = pd.concat([india_weather, us_weather], ignore_index=True)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [8]:
df = pd.concat([india_weather, us_weather],axis=1)
df

       city  temperature  humidity      city  temperature  humidity
0    mumbai           32        80  new york           21        68
1     delhi           45        60   chicago           14        65
2  banglore           30        78   orlando           35        75

# Merge DataFrames

In [9]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore", 'hyderabad'],
    "temperature": [32,45,30,40]})
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2   banglore           30
3  hyderabad           40

In [10]:
humidity_df = pd.DataFrame({
    "city": ["delhi","mumbai","banglore","Raipur"],
    "humidity": [68, 65, 75, 71]})
humidity_df

       city  humidity
0     delhi        68
1    mumbai        65
2  banglore        75
3    Raipur        71

In [11]:
#merge two dataframes with out explicitly mention index
df_q1 = pd.merge(temperature_df, humidity_df, on='city')
df_q1

       city  temperature  humidity
0    mumbai           32        65
1     delhi           45        68
2  banglore           30        75

In [12]:
#OUTER-JOIN
df_q2 = pd.merge(temperature_df, humidity_df, on='city', how='right')
df_q2

       city  temperature  humidity
0     delhi         45.0        68
1    mumbai         32.0        65
2  banglore         30.0        75
3    Raipur          NaN        71

In [34]:
#OUTER-JOIN
df = pd.merge(temperature_df, humidity_df, on='city', how='outer')
df

        city  temperature  humidity
0     mumbai         32.0      65.0
1      delhi         45.0      68.0
2   banglore         30.0      75.0
3  hyderabad         40.0       NaN
4     Raipur          NaN      71.0

# Numerical Indexing (.loc vs iloc)

In [13]:
import pandas as pd
import numpy as np

In [14]:
df = pd.DataFrame([1,2,3,4,5,6,7,8,9,19], index=[49,48,47,46,45, 1, 2, 3, 4, 5])
df

     0
49   1
48   2
47   3
46   4
45   5
1    6
2    7
3    8
4    9
5   19

In [73]:
df.loc[1:4]

   0
1  6
2  7
3  8
4  9

In [15]:
df.iloc[4:8]

    0
45  5
1   6
2   7
3   8

In [16]:
df.loc[45]

0    5
Name: 45, dtype: int64

In [39]:
df.iloc[5]

0    6
Name: 1, dtype: int64